# -- coding: utf-8 --
class oCalendar :
    def __init__(self):
        self.Jan = (
            "---------------"
            + "\n 12.17(월) ~ 01.11(금) 동계 계절학기"
            + "\n 01.02(수) 시무식"
        )

        self.Feb = (
                "---------------"
                + "\n 02.13(수) 2018학년도 학위수여식"
                + "\n 02.19(화) ~ 02.22(금) 1학기 수강신청"
                + "\n 02.22(금) ~ 02.27(수) 1학기 등록기간"
                + "\n 02.26(화) 입학식"
        )
        self.Mar = (
                "---------------"
                + "\n 03.01(금) 삼일절"
                + "\n 03.04(월) 1학기 개강"
        )
        self.Apr = (
                "---------------"
                + "\n 04.26(금) 수업일수 1/2"
        )
        self.May = (
            "---------------"
            + "\n 05.05(일) 어린이날"
            + "\n 05.12(일) 석가탄신일"
        )
        self.June = (
            "---------------"
            + "\n 06.06(목) 현충일"
            + "\n 06.10(월) ~ 06.14(금) 학기말고사"
            + "\n 06.17(월) ~ 06.21(금) 보강기간"
            + "\n 06.24(월) 하계방학"
        )
        self.July = (
            "---------------"
            + "\n 07.01(월) ~ 07.19(금) 하계 계절학기(예정)"
        )
        self.Aug = (
            "---------------"
            + "\n 08.08(목) ~ 08.13(화) 휴학/복학 신청)"
            + "\n 08.09(금) 2018학년도 후기 학위수여일"
            + "\n 08.15(목) 광복절"
            + "\n 08.19(월) ~ 08.23(금) 2학기 등록기간"
            + "\n 08.20(월) ~ 08.23(금) 2학기 수강신청"
            + "\n 08.26(월) 2학기 개강"
        )
        self.Sep = (
            "---------------"
            + "\n 09.12(목) ~ 09.15(일) 추석"
            + "\n 09.25(수) 수원대학교 개교기념일"
        )
        self.Oct = (
            "---------------"
            + "\n 10.03(목) 개천절"
            + "\n 10.09(수) 한글날"
            + "\n 10.18(금) 수업일수 1/2"
        )
        self.Nov = (
            "---------------"
        )
        self.Dec = (
            "---------------"
            + "\n 12.09(월) ~ 12.13(금) 학기말고사"
            + "\n 12.16(월) 동계방학"
            + "\n 12.23(월) ~ 01.10(금) 동계 계절학기"
            + "\n 12.25(수) 성탄절"
        )
