# -- coding: utf-8 --
class oCalendar :
    def __init__(self):
        self.Jan = (
            "---------------"
            + "\n 12.23(월) ~ 01.10(금) 동계 계절학기"
            + "\n 01.02() 시무식"
        )

        self.Feb = (
                "---------------"
                + "\n 02.06(목) ~ 02.11(화) 휴학/복학 신"
                + "\n 02.13(목) 2019학년도 학위수여식"
                + "\n 02.18(화) ~ 02.21(금) 1학기 수강신청"
                + "\n 02.21(금) ~ 02.26(수) 1학기 등록기간"
                + "\n 02.25(화) 입학식"
        )
        self.Mar = (
                "---------------"
                + "\n 03.01(일) 삼일절"
                + "\n 03.02(월) 1학기 개강"
        )
        self.Apr = (
                "---------------"
                + "\n 04.24(금) 수업일수 1/2"
        )
        self.May = (
            "---------------"
            + "\n 05.05(화) 어린이날"
            + "\n 05.12(화) 석가탄신일"
        )
        self.June = (
            "---------------"
            + "\n 06.06() 현충일"
            + "\n 06.8(월) ~ 06.12(금) 학기말고사"
            + "\n 06.15(월) ~ 06.19(금) 보강기간"
            + "\n 06.22(월) 하계방학"
        )
        self.July = (
            "---------------"
            + "\n 06.29(월) ~ 07.17(금) 하계 계절학기(예정)"
        )
        self.Aug = (
            "---------------"
            + "\n 08.13(목) ~ 08.18(화) (휴학/복학 신청)"
            + "\n 08.14(금) 2019학년도 후기 학위수여일"
            + "\n 08.15(토) 광복절"
            + "\n 08.24(월) ~ 08.28(금) 2학기 등록기간"
            + "\n 08.25(화) ~ 08.28(금) 2학기 수강신청"
            + "\n 08.31(월) 2학기 개강"
        )
        self.Sep = (
            "---------------"
            + "\n 09.25(금) 수원대학교 개교기념일"
        )
        self.Oct = (
            "---------------"
            + "\n 10.03(목) 개천절"
            + "\n 10.09(수) 한글날"
            + "\n 10.23(금) 수업일수 1/2"
        )
        self.Nov = (
            "---------------"
        )
        self.Dec = (
            "---------------"
            + "\n 12.07(월) ~ 12.11(금) 학기말고사"
            + "\n 12.14(월) ~ 12.18(금) 보강기간"
            + "\n 12.21(월) 동계방학"
            + "\n 12.28(월) ~ 01.15(금) 동계 계절학기"
            + "\n 12.25(금) 성탄절"
        )
