# -- coding: utf-8 --
class sNotice:

    def __init__(self):
        self.data = (
                "2019 - 06 - 29"
                + "\n1. 학식 메뉴 관련 공지사항"
                + "\n 현재 하계 방학기간으로 학식 메뉴를 제공하지 않습니다."
                + "\n 학기가 시작하는대로 다시 업데이트하겠습니다."
                + "\n 수원대학교 알림이를 사용해주셔서 감사합니다."

                + "\n2. 공지사항 추가 업데이트"
                + "\n 수원대학교 공지사항과, 알림이 공지사항 기능을 추가하였습니다."
                + "\n 수원대학교 공지사항은 Title만 확인하실 수 있고 링크를 추가로 걸어 두었습니다."
                + "\n 알림이 공지사항은 전체 메세지를 보내기 위해서는 금액이 필요합니다."
                + "\n 그래서 간단하게 위 항목을 토대로 공지사항을 전달할 예정입니다."
                + "\n 수원대학교 알림이를 사용해주셔서 감사합니다."
        )
